export default {
    'ru': {
        'home': {
            'title': 'Главная'
        },
        'edit': 'Редактировать',
        'upload_logo': 'Загрузить лого',
        'add': 'Добавить',
        'delete': 'Удалить',
        'action': 'Действия',
        'save': 'Сохранить',
        'create': 'Создать',
        'view': 'Посмотреть',
        'cancel': 'Отменить',
        'yes': 'Есть',
        'no': 'Нет',
        'image': 'Изображения',
        // 'settings': 'Настройки',
        'no_data': 'Нет данных',
        'logout': 'Выйти',
        'list': 'Список',
        'close': 'Закрыть',
        'ye': 'сум',
        'usd': '$',
        'general': 'Общие',

        'auth': {
            'email': 'E-mail',
            'password': 'Пароль',
            'login': 'Войти'
        },

        'messages': {
            'created': 'Успешно создано',
        },

        'notifications': {
            'title': 'Уведомления',
        },

        'roles': {
            'title': 'Ролей',
            'name': 'Названия',
            'users': 'Пользователей',


            'permissions': {
                'name_uz': 'Название группы (UZ)',
                'name_ru': 'Название группы (RU)',

                'placeholder_uz': 'На узбекиском',
                'placeholder_ru': 'На Руском',

                'slug': 'Префикс имени группы',

                'objects': {
                    'view': 'Разрешить просмотр объектов',
                    'create': 'Разрешить создать объект',
                    'update': 'Разрешить редактирование объект',
                    'delete': 'Разрешить удаление объектов',
                    'apartments': 'Разрешить просмотр список квартиры'
                },

                'users': {
                    'view': 'Разрешить просмотр пользователей',
                    'create': 'Разрешить создать пользователей',
                    'update': 'Разрешить редактирование пользователей',
                    'delete': 'Разрешить удаление пользователей'
                },

                'roles': {
                    'view': 'Разрешить просмотр ролей',
                    'create': 'Разрешить создать ролей',
                    'update': 'Разрешить редактирование ролей',
                    'delete': 'Разрешить удаление ролей'
                },

                'clients': {
                    'view': 'Разрешить просмотр клиенты',
                    'cancel_contract': 'Разрешить отменить бронь',
                    'delete': 'Разрешить удаление клиента',
                    'terminate': 'Разрешить отменить контракта',
                    'cancelled': 'Разрешить просмотр  отменение контракты'
                },

                'type_plan': {
                    'view': 'Разрешить просмотр планировки',
                    'update': 'Разрешить редактирование планировки',
                },

                'apartments': {
                    'view': 'Разрешить просмотр квартиры (внутрь квартиры)',
                    'reserve': 'Разрешить бронирование квартиры',
                    'contract': 'Разрешить оформить контракт',
                    'filter': 'Разрешить сортировать квартиры (Filter)',
                    'edit': 'Разрешить редактирование квартиры (Номер, комнат, Площадь и т.д)',
                    'root_contract': 'Разрешить полный доступ контрактам'
                }

            },

            'admin': 'Администратор',
            'manager': 'Менеджер',
            'accountant': 'Бухалтер'
        },

        'clients': {
            'title': 'База клиентов',
            'fio': 'ИМЯ КЛИЕНТА',
            'phone': 'Телефон',
            'amount': 'СТОИМОСТЬ',
            'apartment': 'КВАРТИРА',
            'file': 'ФАЙЛ договора',
            'number': '№ Договора',
            'language': 'Язык',
            'date': 'Дата',
            'search': 'Найти по номеру договора или ФИО клиента'
        },

        'apartments': {
            'list': {
                'number': '№Дом',
                'object': 'Объект',
                'rooms': 'Комнат',
                'floor': 'Этаж',
                'area': 'Площад',
                'status': 'Статус',
                'price': 'Цена',
                'building': 'Здания',
                'block': 'Корпус',
                'book': 'Забронировать',
                'confirm': 'Оформить',
                'filter': 'Фильтр',
                'apartments': 'Квартиры',

                'entrance': 'Подъезд',
                'balcony': 'Балкон',

                'period_date': 'Период брони',
                'more': 'Подробная информация',
                'cancel_contract': 'Отменить контракт',
                'download_contract': 'Скачать контракт',
                'view_client': 'Посмотреть клиент',
                'cancel_reserve': 'Отменить бронь',
                'view_manager': 'Информация о менеджера'
            },

            'filter': {
                'apartments': 'Количество комнат',
                'floor': 'Этаж',
                'ot': 'от',
                'do': 'до',
                'price': 'Цена',
                'area': 'Площадь',
                'object': 'Объект',
                'status': 'Статус',
                'free': 'Только свободные',
                'clear': 'Сбросить'
            },

            'view': {
                'plan': 'Планировка',
                'number': '№ Дома',
                'area': 'Площадь',
                'rooms': 'Комнат',
                'floor': 'Этаж',
                'price_m2': 'Цена за 1м2',
                'total_price': 'Цена продажи',
                'status': 'Статус',
                'variant': 'Вариант оплаты',

            }
        },

        'type_plan': {
            'title': 'Планировоки',
            'name': 'Названия',
            'area': 'Площадь',
            'balcony': 'Балкон',
            'no_img': '(нет планировка)',
            'yes_img': '(Планировка существует)',
            'plan': 'Планировока',
            'plans': 'Все планировки',
            'list': 'Список планировки'
        },

        'debtors': {
            'title': 'Задолжники'
        },

        'backup': {
            'title': 'Резерв'
        },

        'objects': {
            'title': 'Объекты',
            'apartments': 'Квартиры',
            'address': 'Адрес',

            'create': {
                'name': 'Название',
                'blocks_apartment': 'КВАРТИРНЫЕ БЛОКИ',
                'copy_block': 'Клонировать блок',
                'copy_building': 'Клонировать здание',

                'new': 'Создать новый объект',
                'type_plan': 'Типы планировок',
                'no_type_plan': 'нет планировок',
                'new_type_plan': 'Создать планировка',
                'entrance': 'Подъезд',

                'plan': {
                    'name': 'Планировка',
                    'area': 'Площадь',
                    'balcony': 'Имеется балкон?',
                    'balcony_area': 'Площадь балкона',
                    'balcony_paid': 'Платный балкон?'
                },

                'apartments': 'Квартиры',
                'floors': 'Этажи',

                'blocks': 'Блоки',
                'new_block': 'Новый блок',
                'edit_block': 'Редактировать блок',
                'count_floors': 'Количество этажей',
                'count_apartments': 'Количество квартиры',

                'price_area': 'Цена за м2',
                'new_price': 'Новая цена',
                'prices': 'Цены',

                'apartment': 'Квартира',
                'floor': 'Этаж',
                'type_plan_apartment': 'Тип планировоки',
                'rooms': 'Кол-во комнат',
                'area': 'Площадь',
                'price': 'Цена',

                'pre_pay': 'Предоплата',
                'discount': 'Сумма скидки',

                'new_rules_discount': 'Новые условия скидки',

                'prepay_from': 'от',
                'prepay_to': 'до',

                'create_build': 'Добавить здание',
                'create_discount': 'Добавить скидку',

                'choose_plan': 'Выберите планировку'
            },

            'placeholder': {
                'name': 'Названия объекта',
                'address': 'Адрес объекта',
                'type_plan': 'Названия планировку',

                'block_name': 'Названия блока',

                'building_name': 'Названия корпуса'
            }
        },

        'sweetAlert': {
            'title': 'Вы уверены?',
            'text': 'Вы действительно хотите удалить?',
            'yes': 'Да, удалить его',
            'no': '',
            'deleted': 'Удалено!',
            'text_cancel_contract': 'Вы действительно хотите расторгнуть контракт?',
            'yes_cancel_contract': 'Да, расторгнуть',
            'canceled_contract': 'Контракт расторгнуть',


            'text_cancel_reserve': 'Вы действительно хотите отменить бронь?',
            'yes_cancel_reserve': 'Да, отменить',
            'canceled_reserve': 'Бронь отменена',
            'success_create_role': 'Роль успешно создано',
            'success_update_role': 'Роль успешно редактировано',
            'are_you_sure_delete_role': 'Если удалите роль вы должны назначить новый ролей пользователем'
            // 'text_cancel_contract': 'Вы действительно хотите расторгнуть контракт',


        },

        'user': {
            'first_name': 'Имя',
            'last_name': 'Фамилия',
            'phone': 'Телефон',
            'password': 'Пароль',
            'email': 'Э-маил',
            'role': 'Роль'
        },

        'users': {
            'title': 'Пользователи',
            'name': 'Имя',
            'phone': 'Номер',
            'roles': 'Роль',
            'object': 'Объект',
            'login': 'Логин',
        },

        'accountants': {
            'title': 'Бухгалтерия',
            'role_title': 'Бухгалтерия'
        },

        'cashier': {
            'title': 'Кассиры'
        },

        'settings': {
            'title': 'Настройки'
        }
    },
    'uz': {
        'home': 'Bosh sahifa',

        'roles': {
            'admin': 'Rais buva',
            'manager': 'Менеджер',
            'accountant': 'Бухалтер'
        },
    }
}
